app/controllers/conversion_controller.rb

SELECT * FROM `conversions`
---
  def data
    ActiveRecord::Base.include_root_in_json = false

    @all = Conversion.all

SELECT * FROM `conversions` WHERE (`conversions`.`slug` = 'favicon') LIMIT 1
---
  def show

    c = Conversion.find_by_slug(params[:id])