app/controllers/welcome_controller.rb

SELECT * FROM `conversions` ORDER BY category_id
SELECT * FROM `conversions` WHERE (`conversions`.`slug` = 'co2') LIMIT 1
---
  def index
    @all = Conversion.all

    @all.map {|c| c.amount = co2}

    @co2 = @all.select {|c| c.slug == "co2"}[0]